InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыНавигацииВФормахНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыНавигацииВФормахНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидам</Name>
					<Comment>Синоним должен быть как имя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидамИСвойствам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТоварамДругогоКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСовместноПродаваемымТоварам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИерархииПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСвойствам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуреПоставщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование2</Name>
					<Comment>Локализованное наименование 2</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияЯщиков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеМарки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>Срок хранения товара (в днях)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЦенообразования</Name>
					<Comment>Группа ценообразования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцизГруппа</Name>
					<Comment>Группа акциза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАкциза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляБухгалтерии</Name>
					<Comment>Группа для бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатурыПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипНоменклатурыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойАртикул</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИндикатива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_ТипыИндикатива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеRB</Name>
					<Comment>Наименование  для Radio Beacon</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТК_Производитель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Товара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Comment>Способ расчета цены реализации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТК_ПодборТоваровСервер/Ext/Module.bsl
// Возвращает массив областей поиска товаров.
//
// Параметры:
//	Форма - УправляемаяФорма - форма из которой была вызвана функция поиска.
//
// Возвращаемое значение:
//	Массив. Массив метаданных, областей поиска товаров.
//
Функция ОбластиПоискаНоменклатуры(Форма)
	
	// В зависимости от того, из какой формы выполняется вызов функции поиска,
	// список областей поиска будет различаться.
	ОбластиПоиска = Новый Массив;
	
	ОбластиПоиска.Добавить(Метаданные.Справочники.Номенклатура);
	ОбластиПоиска.Добавить(Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
	
	//Если ПодборТоваровКлиентСервер.ЭтоФормаПодбораВДокументыЗакупки(Форма) Тогда
	//	ОбластиПоиска.Добавить(Метаданные.Справочники.НоменклатураПоставщиков);
	//КонецЕсли;
	
	//Если ПолучитьФункциональнуюОпцию("ИспользованиеКлассификаторовНоменклатуры") Тогда
	//КонецЕсли;
	
	Возврат ОбластиПоиска;
	
КонецФункции

// Добавляет отбор в указанную коллекцию области отбора.
//
// Параметры:
//	ОбластьОтбора - ОтборКомпоновкиДанных - отбор динамического списка,
//	ЛевоеЗначение - Строка - путь к данным поля отбора,
//	ПравоеЗначение - Произвольный - значение отбора,
//	ВидОтбора - ВидСравненияКомпоновкиДанных - вид сравнения,
//	Представление - Строка - представление элемента отбора.
//
Процедура ДобавитьЭлементОтбора(ОбластьОтбора, ЛевоеЗначение, ПравоеЗначение, ВидОтбора, Представление = "") Экспорт
	
	ЭлементОтбора                   = ОбластьОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
	ЭлементОтбора.ПравоеЗначение    = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ВидСравнения      = ВидОтбора;
	
	Если ЗначениеЗаполнено(Представление) Тогда
		ЭлементОтбора.Представление = Представление;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает максимальное количество элементов которое может быть обработано
// при выполнении полнотекстового или неполнотекствого поиска. Если количество найденных
// элементов превышает возвращаемое этой функцией значение, то считается что условие поиска задано
// размыто и предлагается уточнить его.
//
Функция МаксимальноеКоличествоЭлементовПоиска()
	
	Возврат 500;
	
КонецФункции

// Выполняет дополнительную обработку результатов поиска:
// если выполнялся поиск по характеристикам, штрихкодам или номенклатуре
// поставщиков, то процедура выполняет дополнительный запроса для поиска
// номенклатуры - владельцев найденных элементов. Найденная номенклатура
// включается в результат поиска в раздел "Номенклатура".
//
// Параметры:
//	РезультатПоиска - Структура - структура результатов поиска.
//
Процедура ДополнитьРезультатыПоискаНоменклатуры(РезультатПоиска)
	
	// Если найдены характеристики номенклатуры, номенклатура поставщиков или штрихкоды номенклатуры,
	// то для них нужно найти владельцев и добавить их в список номенклатуры.
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
	//Если РезультатПоиска.ХарактеристикиНоменклатуры.Количество() > 0 Тогда
	//	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), " ОБЪЕДИНИТЬ ВСЕ ", "") + 
	//	"ВЫБРАТЬ
	//	|	Номенклатура.Ссылка КАК Номенклатура
	//	|ИЗ
	//	|	Справочник.Номенклатура КАК Номенклатура
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//	|		ПО (ВЫБОР
	//	|				КОГДА Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	//	|					ТОГДА Номенклатура.Ссылка
	//	|				КОГДА Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
	//	|					ТОГДА Номенклатура.ВладелецХарактеристик
	//	|				КОГДА Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	//	|					ТОГДА Номенклатура.ВидНоменклатуры
	//	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	//	|			КОНЕЦ = ХарактеристикиНоменклатуры.Владелец)
	//	|ГДЕ
	//	|	ХарактеристикиНоменклатуры.Ссылка В(&СписокХарактеристики)";
	//	
	//	Запрос.УстановитьПараметр("СписокХарактеристики", РезультатПоиска.ХарактеристикиНоменклатуры);
	//КонецЕсли;
	
	Если РезультатПоиска.ШтрихкодыНоменклатуры.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), " ОБЪЕДИНИТЬ ВСЕ ", "") + 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод В(&СписокШтрихкодов)";
		
		Запрос.УстановитьПараметр("СписокШтрихкодов", РезультатПоиска.ШтрихкодыНоменклатуры);
	КонецЕсли;
	
	//Если РезультатПоиска.НоменклатураПоставщиков.Количество() > 0 Тогда
	//	Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), " ОБЪЕДИНИТЬ ВСЕ ", "") + 
	//	"ВЫБРАТЬ
	//	|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура
	//	|ИЗ
	//	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	//	|ГДЕ
	//	|	НоменклатураПоставщиков.Ссылка В(&СписокНоменклатурыПоставщиков)";
	//	
	//	Запрос.УстановитьПараметр("СписокНоменклатурыПоставщиков", РезультатПоиска.НоменклатураПоставщиков);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				РезультатПоиска.Номенклатура.Добавить(Выборка.Номенклатура);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


// Возвращает текст запроса необходимый для выполнения поиска по области.
//
// Параметры:
//	ОбластьПоиска      - ОбъектМетаданных - идентификатор области поиска,
//	ТочноеСоответствие - Булево           - признак выполнения поиска по точному соответствию.
//
Функция ТекстЗапросаПоискаПоОбласти(ОбластьПоиска, ТочноеСоответствие)
	
	МаксКоличество = МаксимальноеКоличествоЭлементовПоиска() + 1;
	ТекстЗапроса = "";
	
	Если ОбластьПоиска = Метаданные.Справочники.Номенклатура Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
		|	СправочникНоменклатура.Ссылка КАК Значение,
		|	""Номенклатура"" КАК Метаданные
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	НЕ СправочникНоменклатура.ЭтоГруппа И
		|	(СправочникНоменклатура.Наименование %ВидСравнения% &СтрокаПоиска
		|			Или СправочникНоменклатура.НаименованиеПолное %ВидСравнения% &СтрокаПоиска
	//	|			Или СправочникНоменклатура.КодДляПоиска %ВидСравнения% &СтрокаПоиска
		|			Или СправочникНоменклатура.Артикул %ВидСравнения% &СтрокаПоиска)";
		
	КонецЕсли;
	//
	//Если ОбластьПоиска = Метаданные.Справочники.НоменклатураПоставщиков Тогда
	//	
	//	ТекстЗапроса = "
	//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ %МаксКоличество%
	//	|	НоменклатураПоставщиков.Ссылка КАК Значение,
	//	|	""НоменклатураПоставщиков"" КАК Метаданные
	//	|ИЗ
	//	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	//	|ГДЕ
	//	|	НЕ НоменклатураПоставщиков.ЭтоГруппа И
	//	|	(НоменклатураПоставщиков.Артикул %ВидСравнения% &СтрокаПоиска
	//	|		Или НоменклатураПоставщиков.Наименование %ВидСравнения% &СтрокаПоиска)
	//	|	И НоменклатураПоставщиков.Владелец = &Партнер";
	//	
	//КонецЕсли;
	
	//Если ОбластьПоиска = Метаданные.Справочники.ХарактеристикиНоменклатуры Тогда
	//	
	//	ТекстЗапроса = "
	//	|ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
	//	|	ХарактеристикиНоменклатуры.Ссылка КАК Значение,
	//	|	""ХарактеристикиНоменклатуры"" КАК Метаданные
	//	|ИЗ
	//	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//	|ГДЕ
	//	|	ХарактеристикиНоменклатуры.Наименование %ВидСравнения% &СтрокаПоиска
	//	|	Или ХарактеристикиНоменклатуры.НаименованиеПолное %ВидСравнения% &СтрокаПоиска";
	//	
	//КонецЕсли;
	
	Если ОбластьПоиска = Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ %МаксКоличество%
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Значение,
		|	""ШтрихкодыНоменклатуры"" КАК Метаданные
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &СтрокаПоискаПоШтрихкоду";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%МаксКоличество%", Формат(МаксКоличество, "ЧЦ=10; ЧГ=0"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВидСравнения%", ?(ТочноеСоответствие, "=", "ПОДОБНО"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает исходную строку поиска - которая была введена на форме поиска.
// Используется при неполнотекстовом поиске.
//
// Параметры:
//	СтрокаПоиска - Строка - строка поиска,
//	ТочноеСоответствие - Булево - признак поиска по точному соответствию.
//
// Возвращаемое значение:
//	Строка. Исходная строка поиска.
//
Функция ИсходнаяСтрокаПоиска(Знач СтрокаПоиска, ТочноеСоответствие)
	
	Если ТочноеСоответствие Тогда
		Возврат СтрокаПоиска;
	КонецЕсли;
	
	Возврат Сред(СтрокаПоиска, 2, СтрДлина(СтрокаПоиска) - 2);
	
КонецФункции

// Устанавливает код ошибки расширенного поиска в структуре результата поиска.
//
// Параметры:
//	СписокПоиска - СписокЗначений - список найденных элементов,
//	РезультатПоиска - Структура - структура результата поиска.
//
Функция УстановитьКодОшибкиРасширенногоПоиска(СписокПоиска, РезультатПоиска)
	
	Если СписокПоиска.СлишкомМногоРезультатов Тогда
		РезультатПоиска.КодОшибки = "СлишкомМногоРезультатов";
	ИначеЕсли СписокПоиска.ПолноеКоличество = 0 Тогда
		РезультатПоиска.КодОшибки = "НичегоНеНайдено";
	ИначеЕсли СписокПоиска.ПолноеКоличество > МаксимальноеКоличествоЭлементовПоиска() Тогда
		РезультатПоиска.КодОшибки = "СлишкомМногоРезультатов";
	Иначе
		РезультатПоиска.КодОшибки = "";
	КонецЕсли;
	
КонецФункции


// Возвращает структуру результатов поиска.
// Используется при неполнотекстовом поиске товаров.
//
Функция СтруктураРезультатовПоиска()
	
	РезультатПоиска = Новый Структура();
	
	РезультатПоиска.Вставить("КодОшибки", "");
	РезультатПоиска.Вставить("Номенклатура", Новый Массив);
	РезультатПоиска.Вставить("ХарактеристикиНоменклатуры", Новый Массив);
	РезультатПоиска.Вставить("ШтрихкодыНоменклатуры", Новый Массив);
	РезультатПоиска.Вставить("НоменклатураПоставщиков", Новый Массив);
	РезультатПоиска.Вставить("ОКП", Новый Массив);
	
	Возврат РезультатПоиска;
	
КонецФункции

// Возвращает структуру списка поиска.
// Используется при неполнотекстовом поиске товаров.
//
Функция СтруктураРезультатаПоиска()
	
	СписокПоиска = Новый Структура;
	
	СписокПоиска.Вставить("Элементы", Новый Массив);
	СписокПоиска.Вставить("ПолноеКоличество", 0);
	СписокПоиска.Вставить("СлишкомМногоРезультатов", Ложь);
	
	Возврат СписокПоиска;
	
КонецФункции

// Возвращает фоматированную строку поиска - строку с добавлением
// служебных символов. Используется при неполнотекстовом поиске.
//
// Параметры:
//	СтрокаПоиска - Строка - строка поиска,
//	ТочноеСоответствие - Булево - признак поиска по точному соответствию.
//
// Возвращаемое значение:
//	Строка. Форматированная строка поиска.
//
Функция ФорматироватьСтрокуПоиска(Знач СтрокаПоиска, ТочноеСоответствие)
	
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат СтрокаПоиска;
	КонецЕсли;
	
	Если ТочноеСоответствие Тогда
		Возврат СтрокаПоиска;
	КонецЕсли;
	
	Если Лев(СтрокаПоиска, 1) <> "%" Тогда
		СтрокаПоиска = "%" + СтрокаПоиска;
	КонецЕсли;
	
	Если Прав(СтрокаПоиска, 1) <> "%" Тогда
		СтрокаПоиска = СтрокаПоиска + "%";
	КонецЕсли;
	
	Возврат СтрокаПоиска;
	
КонецФункции



// Выполняет поиск номенклатуры по строке поиска.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма выбора, форма подбора.
//
// Возвращаемое значение:
//	Булево, Истина - удалось выполнить поиск, элементы найдены, Ложь - не удалось выполнить поиск.
//
Функция ВыполнитьПоискНоменклатуры(Форма) Экспорт
	
	ПоискВыполнен = Ложь;
	
	РезультатПоиска = СтруктураРезультатовПоиска();
	СтрокаПоиска = Форма.СтрокаПоискаНоменклатура;
	
	Форма.ПоискНоменклатурыНеУдачный = Ложь;
	Форма.КодОшибкиПоиска = "";
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Если Не Форма.ИспользоватьПолнотекстовыйПоиск Или Форма.НайтиНоменклатуруПоТочномуСоответствию Тогда
			ВыполнитьНеПолнотекстовыйПоискНоменклатуры(Форма, РезультатПоиска);
		Иначе
			ВыполнитьПолнотекстовыйПоискНоменклатуры(Форма, РезультатПоиска);
		КонецЕсли;
		ПоискВыполнен = Истина;
	КонецЕсли;
	
	Форма.ПоискНоменклатурыНеУдачный = (ПоискВыполнен И ЗначениеЗаполнено(РезультатПоиска.КодОшибки));
	Форма.КодОшибкиПоиска = РезультатПоиска.КодОшибки;
	
	ТК_ПодборТоваровКлиентСервер.УстановитьОтборСпискаПоСтрокеПоиска(
		ОбщегоНазначенияТККлиентСервер.ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура).Элементы,
		РезультатПоиска.Номенклатура, 
		ПоискВыполнен);
		
	Форма.ЕстьФильтрПоПоискуНоменклатуры = ПоискВыполнен;
	
	
	Возврат ПоискВыполнен;
	
КонецФункции


// Выполняет неполнотекстовый поиск номенклатуры по строке поиска.
//
// Параметры:
//	Форма - УправляемаяФорма - форма из которой была вызвана функция поиска,
//	РезультатПоиска - Неопределено - переменная, в которую записывается структура, результат поиска.
//
Процедура ВыполнитьНеПолнотекстовыйПоискНоменклатуры(Форма, РезультатПоиска)
	
	РезультатПоиска = СтруктураРезультатовПоиска();
	СписокПоиска = РезультатПоискаНоменклатуры(Форма);
	УстановитьКодОшибкиРасширенногоПоиска(СписокПоиска, РезультатПоиска);
	ОбработатьСписокПоиска(СписокПоиска, РезультатПоиска);
	ДополнитьРезультатыПоискаНоменклатуры(РезультатПоиска);
	
КонецПроцедуры

// Возвращает результат поиска номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма подбора, форма списка.
//
// Возвращаемое значение:
//	Структура - результат поиска товаров.
//
Функция РезультатПоискаНоменклатуры(Форма)
	
	ТочноеСоответствие = Форма.НайтиНоменклатуруПоТочномуСоответствию;
	
	СтрокаПоиска = ФорматироватьСтрокуПоиска(Форма.СтрокаПоискаНоменклатура, ТочноеСоответствие);
	ОбластиПоиска = ОбластиПоискаНоменклатуры(Форма);
	МаксимальноеКоличествоЭлементовПоиска = МаксимальноеКоличествоЭлементовПоиска();
	РезультатПоиска = СтруктураРезультатаПоиска();
	
	// Сформировать текст запроса по областям поиска.
	Запрос = Новый Запрос;
	
	РазделительВТекстеЗапросов = "
	|;
	|";
	
	Для каждого ОбластьПоиска Из ОбластиПоиска Цикл
		ТекстЗапросаПоискаПоОбласти = ТекстЗапросаПоискаПоОбласти(ОбластьПоиска, ТочноеСоответствие);
		
		Запрос.Текст = Запрос.Текст + ?(ЗначениеЗаполнено(Запрос.Текст), РазделительВТекстеЗапросов, "") + ТекстЗапросаПоискаПоОбласти;
		
		Если ОбластьПоиска = Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры Тогда
			Запрос.УстановитьПараметр("СтрокаПоискаПоШтрихкоду", ИсходнаяСтрокаПоиска(СтрокаПоиска, ТочноеСоответствие));
		КонецЕсли;
		
		//Если ОбластьПоиска = Метаданные.Справочники.НоменклатураПоставщиков Тогда
		//	Запрос.УстановитьПараметр("Партнер", Форма.ПоставщикПартнер);
		//КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Добавить найденные элементы в список поиска. Как только количество элементов в списке
	// превысит максимальное количество найденных элементов, прервать цикл обхода.
	Для каждого РезультатЗапроса Из РезультатыЗапроса Цикл
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЭлементПоиска = Новый Структура("Значение, Метаданные");
			ЗаполнитьЗначенияСвойств(ЭлементПоиска, Выборка);
			
			РезультатПоиска.Элементы.Добавить(ЭлементПоиска);
			
			Если РезультатПоиска.Элементы.Количество() > МаксимальноеКоличествоЭлементовПоиска Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если РезультатПоиска.Элементы.Количество() > МаксимальноеКоличествоЭлементовПоиска Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РезультатПоиска.ПолноеКоличество = РезультатПоиска.Элементы.Количество();
	РезультатПоиска.СлишкомМногоРезультатов = (РезультатПоиска.ПолноеКоличество > МаксимальноеКоличествоЭлементовПоиска);
	
	Возврат РезультатПоиска;
	
КонецФункции

// Выполняет обрабтку списка результатов поиска. Вызывается функция определения принадлежности
// найденного элемента к разделу метаданных.
//
// Параметры:
//	СписокПоиска - СписокЗначений - список найденных элементов,
//	РезультатПоиска - Структура - структура результата поиска.
//
Процедура ОбработатьСписокПоиска(СписокПоиска, РезультатПоиска)
	
	// Если количество найденных элементов не превышает заданного ограничения,
	// то включить элементы из списка поиска в результаты поиска.
	ВГраница = СписокПоиска.Элементы.ВГраница();
	
	Для А = 0 По ВГраница Цикл
		ЭлементСписка = СписокПоиска.Элементы[А];
		ОбработатьЭлементСпискаПоиска(ЭлементСписка, РезультатПоиска);
	КонецЦикла;
	
КонецПроцедуры


// Проверяет принадлежность элемента списка поиска, в зависиимости
// от принадлежности элемента к типу метаданных, включает значение элемента
// в нужный раздел результата поиска.
//
// Параметры:
//	ЭлементСписка - ЭлементСпискаЗначений - элемент списка поиска,
//	РезультатПоиска - Структура - структура результатов поиска.
//
Процедура ОбработатьЭлементСпискаПоиска(ЭлементСписка, РезультатПоиска)
	
	МетаданныеЭлемента = ЭлементСписка.Метаданные;
	ЗначениеЭлемента = ЭлементСписка.Значение;
	
	Если ТипЗнч(МетаданныеЭлемента) = Тип("ОбъектМетаданных") Тогда
		
		Если МетаданныеЭлемента = Метаданные.Справочники.Номенклатура Тогда
			РезультатПоиска.Номенклатура.Добавить(ЗначениеЭлемента);
		//ИначеЕсли МетаданныеЭлемента = Метаданные.Справочники.ХарактеристикиНоменклатуры Тогда
		//	РезультатПоиска.ХарактеристикиНоменклатуры.Добавить(ЗначениеЭлемента);
		ИначеЕсли МетаданныеЭлемента = Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры Тогда
			РезультатПоиска.ШтрихкодыНоменклатуры.Добавить(ЗначениеЭлемента.Штрихкод);
		//ИначеЕсли МетаданныеЭлемента = Метаданные.Справочники.НоменклатураПоставщиков Тогда
		//	РезультатПоиска.НоменклатураПоставщиков.Добавить(ЗначениеЭлемента);
		Иначе
			ВызватьИсключение НСтр("ru='Неизвестная ошибка';uk='Невідома помилка'");
		КонецЕсли;
		
	Иначе
		
		Если МетаданныеЭлемента = "Номенклатура" Тогда
			РезультатПоиска.Номенклатура.Добавить(ЗначениеЭлемента);
		//ИначеЕсли МетаданныеЭлемента = "ХарактеристикиНоменклатуры" Тогда
		//	РезультатПоиска.ХарактеристикиНоменклатуры.Добавить(ЗначениеЭлемента);
		ИначеЕсли МетаданныеЭлемента = "ШтрихкодыНоменклатуры" Тогда
			РезультатПоиска.ШтрихкодыНоменклатуры.Добавить(ЗначениеЭлемента);
		//ИначеЕсли МетаданныеЭлемента = "НоменклатураПоставщиков" Тогда
		//	РезультатПоиска.НоменклатураПоставщиков.Добавить(ЗначениеЭлемента);
		Иначе
			ВызватьИсключение НСтр("ru='Неизвестная ошибка';uk='Невідома помилка'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет полнотекстовый поиск номенклатуры по строке поиска введенной в форме.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма выбора. форма подбора,
//	РезультатПоиска - Неопределено - переменная, в которую записывается результат поиска.
//
Процедура ВыполнитьПолнотекстовыйПоискНоменклатуры(Форма, РезультатПоиска)
	
	СтрокаПоиска = Форма.СтрокаПоискаНоменклатура;
	РезультатПоиска = СтруктураРезультатовПоиска();
	МаксимальноеКоличествоЭлементовПоиска = МаксимальноеКоличествоЭлементовПоиска();
	
	// Создать список поиска.
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска);
	СписокПоиска.ПолучатьОписание = Ложь;
	СписокПоиска.ОбластьПоиска = ОбластиПоискаНоменклатуры(Форма);
	
	Попытка
		СписокПоиска.ПерваяЧасть();
	Исключение
		РезультатПоиска.КодОшибки = "ОшибкаПоиска";
		Возврат;
	КонецПопытки;
	
	Если СписокПоиска.СлишкомМногоРезультатов() Тогда
		РезультатПоиска.КодОшибки = "СлишкомМногоРезультатов";
		Возврат;
	КонецЕсли;
	
	КоличествоРезультатов = СписокПоиска.ПолноеКоличество();
	
	Если КоличествоРезультатов = 0 Тогда
		РезультатПоиска.КодОшибки = "НичегоНеНайдено";
		Возврат;
	КонецЕсли;
	
	Если КоличествоРезультатов > МаксимальноеКоличествоЭлементовПоиска Тогда
		РезультатПоиска.КодОшибки = "СлишкомМногоРезультатов";
		Возврат;
	КонецЕсли;
	
	// Пройти по списку поиска.
	РазмерПорции = 20;
	НачальнаяПозиция = 0;
	ВГраница = ?(КоличествоРезультатов > РазмерПорции, РазмерПорции, КоличествоРезультатов) - 1;
	
	ЕстьСледующаяПорция = Истина;
	
	Пока ЕстьСледующаяПорция Цикл
		Для А = 0 По ВГраница Цикл
			ЭлементСписка = СписокПоиска.Получить(А);
			ОбработатьЭлементСпискаПоиска(ЭлементСписка, РезультатПоиска);
		КонецЦикла;
		
		НачальнаяПозиция = НачальнаяПозиция + РазмерПорции;
		ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоРезультатов - 1);
		
		Если ЕстьСледующаяПорция Тогда
			ВГраница = ?(КоличествоРезультатов > (НачальнаяПозиция + РазмерПорции), РазмерПорции, КоличествоРезультатов - НачальнаяПозиция) - 1;
			СписокПоиска.СледующаяЧасть();
		КонецЕсли;
	КонецЦикла;
	
	ДополнитьРезультатыПоискаНоменклатуры(РезультатПоиска);
	
КонецПроцедуры

// Восстанавливает значение реквизитов на форме из хранилища общих настроек.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма выбора.
//
Процедура УстановитьЗначенияПоНастройкамФормы(Форма)
	
	// Установить значения по умолчанию.
	Форма.ИспользоватьФильтры = Истина;
	Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии;
	Форма.ТекущаяИерархияНоменклатуры = Справочники.Номенклатура.ПустаяСсылка();


	
	
КонецПроцедуры

// Заполняет дерево отборов по свойствам вида номенклатуры выбранного на форме.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка номенклатуры или форма подбора.
//
Процедура ЗаполнитьДеревоОтборовНоменклатуры(Форма) Экспорт
	
	ДеревоОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	ДеревоОтборов.Строки.Очистить();
	
	ЗаполнитьДеревоЗначенийОтборов(Форма, ДеревоОтборов, Ложь);
	
	Если ТК_ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма) Тогда
		ЗаполнитьДеревоЗначенийОтборов(Форма, ДеревоОтборов, Истина);
	КонецЕсли;
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	
КонецПроцедуры

// Заполняет дерево значений отборов формы (списка, подбора) значениями
// отбора для номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма подбора.
//	ДеревоОтборов (ДеревоЗначений) - дерево значений отборов свойств.
//
Процедура ЗаполнитьДеревоЗначенийОтборов(Форма, ДеревоОтборов, ПоХарактеристикам)
	
	Возврат;
КонецПроцедуры

// Расставляет флаги для дерева отбора на формах подбора.
//
Процедура ЗаполнитьДеревоОтбораИзСохраненныхПараметров(Форма) Экспорт
	
	ДеревоОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	
	ТаблицаПараметровОтбора = Форма.ТаблицаПараметровОтбора.Выгрузить();
	
	ТекущиеИмяРеквизита = "";
	
	Отбор = Новый Структура();
	Отбор.Вставить("Отбор",Истина);
	ОтобранныеСтроки = ТаблицаПараметровОтбора.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаТаблицы Из ОтобранныеСтроки Цикл
		
		Если СтрокаТаблицы.ИмяРеквизита <> ТекущиеИмяРеквизита Тогда
			
			ТекущиеИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
			
			ЕстьПометкаНаВторомУровне = Ложь;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Представление", ТекущиеИмяРеквизита);
			СтрокаДереваПервогоУровня = ДеревоОтборов.Строки.НайтиСтроки(ПараметрыОтбора, Ложь);
			
			Если СтрокаДереваПервогоУровня.Количество()>0 Тогда
				
				Если СтрокаДереваПервогоУровня[0].ФиксированноеЗначение <> СтрокаТаблицы.ФиксированноеЗначение Тогда
					СтрокаНайдена = Ложь;
					Продолжить;
				КонецЕсли;
				
				Если СтрокаТаблицы.ФиксированноеЗначение Тогда
					
					СтрокаДереваПервогоУровня[0].ФиксированноеЗначение = Истина;
					СтрокаДереваПервогоУровня[0].ЗначениеОтбора = СтрокаТаблицы.ЗначениеОтбора;
					СтрокаДереваПервогоУровня[0].ПредставлениеОтбора = СтрокаТаблицы.ПредставлениеОтбора;
					СтрокаДереваПервогоУровня[0].Отбор = Истина;
					
					Если СтрокаТаблицы.ИнтервалДаты Тогда
						
						СтрокаДереваПервогоУровня[0].ФиксированноеЗначение = Истина;
						СтрокаДереваПервогоУровня[0].ЗначениеОтбора = СтрокаТаблицы.ЗначениеОтбора;
						СтрокаДереваПервогоУровня[0].ПредставлениеОтбора = СтрокаТаблицы.ПредставлениеОтбора;
						СтрокаДереваПервогоУровня[0].ИнтервалОт = СтрокаТаблицы.ИнтервалДатыОт;
						СтрокаДереваПервогоУровня[0].ИнтервалДо = СтрокаТаблицы.ИнтервалДатыДо;
						
						Продолжить;
						
					ИначеЕсли СтрокаТаблицы.ИнтервалЧисла Тогда
						
						СтрокаДереваПервогоУровня[0].ФиксированноеЗначение = Истина;
						СтрокаДереваПервогоУровня[0].ЗначениеОтбора = СтрокаТаблицы.ЗначениеОтбора;
						СтрокаДереваПервогоУровня[0].ПредставлениеОтбора = СтрокаТаблицы.ПредставлениеОтбора;
						СтрокаДереваПервогоУровня[0].ИнтервалОт = СтрокаТаблицы.ИнтервалЧислаОт;
						СтрокаДереваПервогоУровня[0].ИнтервалДо = СтрокаТаблицы.ИнтервалЧислаДо;
						
						Продолжить;
						
					КонецЕсли;
					
					Продолжить;
					
				ИначеЕсли ТипЗнч(СтрокаТаблицы.ЗначениеОтбора) = Тип("Булево") Тогда
					
					СтрокаДереваПервогоУровня[0].ЗначениеОтбора = СтрокаТаблицы.ЗначениеОтбора;
					СтрокаДереваПервогоУровня[0].Отбор = Истина;
					
				КонецЕсли;
				
				СтрокиДереваВторогоУровня = СтрокаДереваПервогоУровня[0].Строки;
				СтрокаНайдена= Истина;
				
			Иначе
				
				СтрокаНайдена = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаНайдена Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Представление", СтрокаТаблицы.Представление);
			СтрокаПоиска = СтрокиДереваВторогоУровня.НайтиСтроки(ПараметрыОтбора, Ложь);
			
			Если СтрокаПоиска.Количество() > 0 Тогда
				
				СтрокаПоиска[0].Отбор = Истина;
				СтрокаДереваПервогоУровня[0].Отбор = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	
КонецПроцедуры


// Очищает дерево свойств для отбора по свойствам вида номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка номенклатуры или форма подбора.
//
Процедура ОчиститьДеревоОтборов(Форма)
	
	ДеревоОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	ДеревоОтборов.Строки.Очистить();
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	
КонецПроцедуры


// Вызывается из обработчика события "ПриСозданииНаСервере" форм списков.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, формы выбора.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	
	УстановитьЗначенияПоНастройкамФормы(Форма);
	
	// Установить страницу варианта навигации по списку номенклатуры.
	УстановитьСтраницуВариантаНавигации(Форма);

	
	ОбщегоНазначенияТК.ИнициализироватьРеквизитыФормыДляПолнотекстовогоПоиска(Форма, "ИспользоватьПолнотекстовыйПоискПриПодбореТоваров");
	
КонецПроцедуры


// Сохраняет значения реквизитов на форме в хранилище общих настроек.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма выбора.
//
Процедура СохранитьНастройкиФормы(Форма) Экспорт
	
КонецПроцедуры


// Обрабатывает переданное в параметрах формы значение для отбора списка номенклатуры по типу номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма подбора.
//
Процедура УстановитьОтборПоТипуНоменклатурыПоПараметрам(Форма)

	Возврат;	
КонецПроцедуры


// Обрабатывает переданное в параметрах формы значение для отбора списка номенклатуры по виду номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма подбора.
//
Процедура УстановитьОтборПоВидНоменклатурыПоПараметрам(Форма) Экспорт

	Возврат;	
КонецПроцедуры



#Область УправлениеВидимостьюСтраницСПараметрамиНавигации

// Устанавливает страницу варианта навигации на форме подбора.
//
// Параметры:
//  Форма						 - УправляемаяФорма	 - форма списка номенклатуры или форма подбора.  
//  ВариантНавигацииДоИзменения	 - ПеречислениеСсылка.ВариантыНавигацииВФормахНоменклатуры - вариант навигации, который был в форме до выбора нового варианта.
//									Параметр передается для реализации возможности возврата к предыдущему варианту навигации и актуален для
//									вариантов "ПоТоварамДругогоКачеста" и "ПоСовместнымПродажам"
//
Процедура УстановитьСтраницуВариантаНавигации(Форма, ВариантНавигацииДоИзменения = Неопределено) Экспорт
	
	//Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Ложь;
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархииПоставщика Тогда
	//	СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатурыПоставщика;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Ложь;
	//ИначеЕсли Не ЗначениеЗаполнено(Форма.ВариантНавигации) Тогда
	//	СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
	//	Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Ложь;
	//ИначеЕсли (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
	//	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
	//	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) Тогда
	//	СтраницаВариантаНавигации = Форма.Элементы.НавигацияВидыНоменклатуры;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Истина;
	//	
	//	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
	//		Форма.Элементы.ДеревоОтборов.Видимость    = Истина;
	//		Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
	//		Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Истина;
	//	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
	//		Форма.Элементы.ДеревоОтборов.Видимость    = Ложь;
	//		Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
	//		Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Ложь;
	//	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
	//		Форма.Элементы.ДеревоОтборов.Видимость    = Истина;
	//		Форма.Элементы.ВидНоменклатуры.Видимость  = Истина;
	//		Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Истина;
	//	КонецЕсли;
	//	
	//	Если ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма)
	//		ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма)
	//		ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма) Тогда
	//		
	//		Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
	//			Форма.Элементы.ВидыНоменклатуры.Видимость = Истина;
	//		ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
	//			Форма.Элементы.ВидыНоменклатуры.Видимость = Истина;
	//		ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
	//			Форма.Элементы.ВидыНоменклатуры.Видимость = Ложь;
	//		КонецЕсли;
	//	КонецЕсли;
	//
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам Тогда
	//	СтраницаВариантаНавигации = Форма.Элементы.СтраницаПодобранныеТовары;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Ложь;
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества Тогда
	//	Если ПодборТоваровКлиентСервер.ЭтоФормаПодобныеТоварыНоменклатуры(Форма) Тогда
	//		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
	//	Иначе
	//		СтраницаВариантаНавигации = Форма.Элементы.СтраницаТоварыДругогоКачества;
	//	КонецЕсли;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Ложь;
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоНоменклатуре Тогда
	//	Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Ложь;
	//	СтраницаВариантаНавигации = Форма.Элементы.НавигацияНоменклатура;
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоНоменклатуреПоставщика Тогда
	//	Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
	//	Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Ложь;
	//	СтраницаВариантаНавигации = Форма.Элементы.НавигацияНоменклатураПоставщика;
	//КонецЕсли;
	//
	//ВозвратКФильтрам = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества
	//Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам;
	//
	//Если ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма)
	//	ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма)
	//	ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма) Тогда
	//	Форма.Элементы.ИспользоватьФильтры.Доступность = Не ВозвратКФильтрам;
	//	Форма.Элементы.СтандартныйПоискКомандаяПанельУстановитьФильтр.Доступность = Не ВозвратКФильтрам;
	//	Форма.Элементы.РасширенныйПоискКомандаяПанельУстановитьФильтр.Доступность = Не ВозвратКФильтрам;
	//	Форма.Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюНоменклатураСАналогичнымиСвойствами.Доступность = Не ВозвратКФильтрам;
	//	Форма.Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюТоварыДругогоКачества.Доступность = Не ВозвратКФильтрам;
	//	Форма.Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюНоменклатураСАналогичнымиСвойствами.Доступность = Не ВозвратКФильтрам;
	//	Форма.Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюТоварыДругогоКачества.Доступность = Не ВозвратКФильтрам;
		СформироватьНадписьВариантНавигации(Форма, ВариантНавигацииДоИзменения);
	//КонецЕсли;

	Форма.Элементы.ВариантыНавигации.ТекущаяСтраница = СтраницаВариантаНавигации;
	
КонецПроцедуры

// Формирует представление варианта навигации
//
// Параметры:
//  Форма						 - УправляемаяФорма - форма списка номенклатуры или форма подбора 
//  ВариантНавигацииДоИзменения	 - ПеречислениеСсылка.ВариантыНавигацииВФормахНоменклатуры - вариант навигации, который был в форме до выбора нового варианта.
//									Параметр передается для реализации возможности возврата к предыдущему варианту навигации и актуален для
//									вариантов "ПоТоварамДругогоКачеста" и "ПоСовместнымПродажам"
//
Процедура СформироватьНадписьВариантНавигации(Форма, ВариантНавигацииДоИзменения = Неопределено)
	МассивСтрокНадписи = Новый Массив();
		
	//Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		МассивСтрокНадписи.Добавить(НСтр("ru='Иерархия номенклатуры';uk='Ієрархія номенклатури'"));
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества Тогда
	//	МассивСтрокНадписи.Добавить(НСтр("ru='Товары другого качества';uk='Товари іншої якості'"));
	//	МассивСтрокНадписи.Добавить("  ");
	//	МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Назад';uk='Назад'"),
	//	,
	//	,
	//	,
	//	ОбщегоНазначения.ИмяЗначенияПеречисления(ВариантНавигацииДоИзменения)));
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам Тогда
	//	МассивСтрокНадписи.Добавить(НСтр("ru='Совместные продажи';uk='Спільні продажі'"));
	//	МассивСтрокНадписи.Добавить("  ");
	//	МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Назад';uk='Назад'"),
	//	,
	//	,
	//	,
	//	ОбщегоНазначения.ИмяЗначенияПеречисления(ВариантНавигацииДоИзменения)));
	//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам 
	//	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам 
	//	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
	//	
	//	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда 
	//		МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Виды и свойства';uk='Види і властивості'"),
	//		Новый Шрифт(,,Истина),
	//		Форма.ЦветТекстаФормы,
	//		,));
	//	Иначе
	//		МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Виды и свойства';uk='Види і властивості'"),
	//		,
	//		,
	//		,
	//		ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам)));
	//	КонецЕсли;
	//	
	//	МассивСтрокНадписи.Добавить("  ");
	//	
	//	
	//	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
	//		МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Виды';uk='Види'"),
	//		Новый Шрифт(,,Истина),
	//		Форма.ЦветТекстаФормы,
	//		,));
	//	Иначе
	//		МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Виды';uk='Види'"),
	//		,
	//		,
	//		,
	//		ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам)));
	//	КонецЕсли;
	//	
	//	МассивСтрокНадписи.Добавить("  ");
	//	
	//	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
	//		МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Свойства';uk='Властивості'"),
	//		Новый Шрифт(,,Истина),
	//		Форма.ЦветТекстаФормы,
	//		,));
	//	Иначе
	//		МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Свойства';uk='Властивості'"),
	//		,
	//		,
	//		,
	//		ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам)));
	//	КонецЕсли;
	//Иначе
	//	МассивСтрокНадписи = Новый Массив();
	//КонецЕсли;
	//
	Если МассивСтрокНадписи.Количество() > 0 Тогда
		Форма.НадписьВариантНавигации = Новый ФорматированнаяСтрока(МассивСтрокНадписи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


// Вызывается из форм подборов при изменении флажка использования фильтров.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка номенклатуры или форма подбора.
//
Процедура ПриИзмененииИспользованияФильтров(Форма) Экспорт

	ЭтоФормаПодбора = ТК_ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма);
	
	//Если ПодборТоваровКлиентСервер.ЭтоФормаВыбораХарактеристик(Форма) Тогда
	//	
	//	УдалитьОтборПоСвойствамВидаНоменклатуры(Форма);
	//	
	//	Если Форма.ИспользоватьФильтры Тогда
	//		УстановитьОтборПоСвойствамВидаНоменклатуры(Форма);
	//	КонецЕсли;
	//	
	//Иначе
		
		//Если (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
		//	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
		//	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) Тогда
		//	
		//	Форма.ВидНоменклатурыДоИзменения = Неопределено;
		//	ПриИзмененииВидаНоменклатуры(Форма);
		//	
		//Иначе
		//	
			Если Форма.ИспользоватьФильтры Тогда
				
				//Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
					
					УстановитьТекущуюСтрокуИерархииНоменклатуры(Форма);
					ТК_ПодборТоваровКлиентСервер.УстановитьОтборПоИерархииНоменклатуры(Форма);
					
				//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам Тогда
				//	
				//	УстановитьОтборПоНоменклатуреПродаваемойСовместно(Форма);
				//	
				//ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества Тогда
				//	
				//	УстановитьОтборПоНоменклатуреИсходногоКачества(Форма);
				//	УстановитьОтборПоКачествуНоменклатуры(Форма);
				//	
				//КонецЕсли;
				
			Иначе
				
				ТК_ПодборТоваровКлиентСервер.УдалитьОтборПоИерархииНоменклатуры(Форма);
				//УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
				//
				//Если Не ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма) 
				//	Или Не Форма.ВыборТовараДругогоКачества Тогда
				//	УдалитьОтборПоКачествуНоменклатуры(Форма);
				//КонецЕсли;
				//
				//УдалитьОтборПоНоменклатуреИсходногоКачества(Форма);
				//
				//Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам Тогда
				//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
				//	Форма.СписокНоменклатура,,"ПоНоменклатуреПродаваемойСовместно");
				//КонецЕсли;
				
			КонецЕсли;
			
			ПерейтиКСпискуНоменклатуры(Форма);
		//КонецЕсли;
		
	//КонецЕсли;
	
	ТК_ПодборТоваровКлиентСервер.УстановитьДоступностьЭлементовФильтров(Форма);
	
КонецПроцедуры

// Устанавливает текущей страницу со списком номенклатуры.
// Используется в формах подборов (в документ продажи, закупки).
//
// Параметры:
//	Форма - УправляемаяФорма - форма подбора.
//
Процедура ПерейтиКСпискуНоменклатуры(Форма)
	
	Элементы = Форма.Элементы;
	
	ЭтоФормаПодбора = ТК_ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма);
	ЭтоФормаСпискаНоменклатуры = ТК_ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма);
	ЭтоФормаВыбораНоменклатуры = ТК_ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма);
	
	Если ЭтоФормаПодбора Тогда
		
		Если Форма.НавигацияПоХарактеристикам Тогда
			
			ИмяСтраницыНоменклатуры = ТК_ПодборТоваровКлиентСервер.ИмяСтраницыНоменклатурыПоВариантуПоиска(Форма);
			Элементы.СтраницыСписков.ТекущаяСтраница = Элементы[ИмяСтраницыНоменклатуры];
			
			Форма.НавигацияПоХарактеристикам = Ложь;
			Элементы.СегментНоменклатуры.ТолькоПросмотр = Ложь;
			
			ИмяСпискаНоменклатуры = ТК_ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма);
			
			Если ЗначениеЗаполнено(Форма.СтрокаПоискаНоменклатура) Тогда
				Форма.ТекущийЭлемент = Форма.Элементы.СтрокаПоискаНоменклатура;
			Иначе
				Форма.ТекущийЭлемент = Форма.Элементы[ИмяСпискаНоменклатуры];
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает отбор по родителю текущей строки списка номенклатуры
// в формах подборов товаров.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка номенклатуры или форма подбора.
//
Процедура УстановитьТекущуюСтрокуИерархииНоменклатуры(Форма)
	
	ТекущаяСтрока = Форма.Элементы[ТК_ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма)].ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока, "Родитель");
	
	Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока = Родитель;
	Форма.ТекущаяИерархияНоменклатуры = Родитель; 
	
КонецПроцедуры
